Autodesk.Revit.DB.TemporaryViewMode
Enumeration to represent the various temporary view modes a view can be in.
Since:
2012

Autodesk.Revit.DB.TemporaryViewMode.PreviewFamilyVisibility
The view is in the mode that shows visibility settings applied in the environment of a family document.

Autodesk.Revit.DB.TemporaryViewMode.RevealConstraints
The view is in the mode that reveals constraints between elements in the model.

Autodesk.Revit.DB.TemporaryViewMode.ExplodedView
The view is in the mode that shows the model in exploded view and allows user changes/configurations

Autodesk.Revit.DB.TemporaryViewMode.Raytrace
The view is in the mode that shows the model in interactive raytracing

Autodesk.Revit.DB.TemporaryViewMode.TemporaryViewProperties
The view is in the selected View Properties applied temporarily.

Autodesk.Revit.DB.TemporaryViewMode.WorksharingDisplay
The view is in one of the worksharing display modes

Autodesk.Revit.DB.TemporaryViewMode.TemporaryHideIsolate
The view is in temporary hide/isolate mode

Autodesk.Revit.DB.TemporaryViewMode.RevealHiddenElements
The view is in reveal hidden elements mode